app/views/comments/_comment.html.erb

INSERT INTO "comments" ("post_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 2], ["body", "test"], ["created_at", "2021-01-20 00:36:53.183079"], ["updated_at", "2021-01-20 00:36:53.183079"]]
---
    <p><strong>
      Posted <%= time_ago_in_words(comment.created_at) %>