app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("post_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 2], ["body", "test"], ["created_at", "2021-01-20 00:36:53.183079"], ["updated_at", "2021-01-20 00:36:53.183079"]]
---
  def create
    #@comment = Comment.new(comment_params)
    @post=Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)